# SD202 TP2 - Normalization and SQL

The objectives of this TP are the following:

1. Apply normalization 1NF -> 2NF -> 3NF -> BCNF
2. Perform SQL queries on the normalized database

In this lab, we are going to use a database containing wine information related to 'production' and 'sales'. 

Production <---> Wine <---> Sales

First, we are going to normalize it, and after that, we are going to write some SQL queries.

The __wine.db__ database contains the following tables:

+-----------------------------------------+
|                 Master1                 |
+-----------------------------------------+
| NV:      Wine number                    |
| CRU:     Vineyard or group of vineyards |
| DEGRE:   Alcohol content                |
| MILL:    Vintage year                   |
| QTE:     Number of bottles harvested    |
| NP:      Producer number                |
| NOM:     Producer's last name           |
| PRENOM:  Producer's first name          |
| REGION:  Wine growing region            |
+-----------------------------------------+

+-------------------------------------------------------------------+
|                              Master2                              |
+-------------------------------------------------------------------+
| NV:      Wine number                                              |
| CRU:     Vineyard or group of vineyards                           |
| DEGRE:   Alcohol content                                          |
| MILL:    Vintage year                                             |
| DATES:   Buying date                                              |
| LIEU:    Place where the wine was sold                            |
| QTE:     Number of bottles bought                                 |
| NB:      Client (buveur) number                                   |
| NON:     Client's last name                                       |
| PRENOM:  Client's first name                                      |
| TYPE:    Type of client by volume of purchases                    |
| REGION:  Administrative Region (different to wine growing region) |
+-------------------------------------------------------------------+

We need to prepare the SQL environment:

In [1]:
import sqlite3

In [2]:
def printSchema(connection):
    ### Source: http://stackoverflow.com/a/35092773/4765776
    for (tableName,) in connection.execute(
        """
        select NAME from SQLITE_MASTER where TYPE='table' order by NAME;
        """
    ):
        print("{}:".format(tableName))
        for (
            columnID, columnName, columnType,
            columnNotNull, columnDefault, columnPK,
        ) in connection.execute("pragma table_info('{}');".format(tableName)):
            print("  {id}: {name}({type}){null}{default}{pk}".format(
                id=columnID,
                name=columnName,
                type=columnType,
                null=" not null" if columnNotNull else "",
                default=" [{}]".format(columnDefault) if columnDefault else "",
                pk=" *{}".format(columnPK) if columnPK else "",
            ))

In [3]:
conn = sqlite3.connect('wine.db')
c = conn.cursor()
print("Database schema:")
#printSchema(conn)          # An usefull way to viualize the content of the database

Database schema:

We recommend inline __%sql__ as an alternative to sqlite3 package

In [4]:
%load_ext sql
%sql sqlite:///wine.db

'Connected: @wine.db'

Now, we can see the content of the tables using SQL queries:

In [5]:
%sql SELECT DISTINCT NOM, PRENOM FROM MASTER1 LIMIT 3;

 * sqlite:///wine.db
Done.

[('Six', 'Paul'), ('Marmagne', 'Bernard'), ("Lioger d'Harduy", 'Gabriel')]

In [6]:
%sql SELECT DISTINCT NV,CRU,DEGRE,MILL,DATES,LIEU,QTE FROM MASTER2 LIMIT 3;

 * sqlite:///wine.db
Done.

[(None, None, None, None, None, None, None),
 (1, 'Mercurey', 11.5, 1980, '1977-11-02', 'BORDEAUX', 33),
 (1, 'Mercurey', 11.5, 1980, '2015-10-16', 'PARIS', 1)]

# PART I: Database normalization

The first task on this TP is the normalization of the wine data. In its current state both tables Master1 and Master2 are in the First Normal Form (1NF) and suffer from data redundancy, update, deletion and insertion anomalies.

__1.1__ Convert table Master1 to the Second Normal Form (2NF), Third Normal Form (3NF) and Boyce-Codd Normal Form(BCNF).
* Explain your answer
* List functional dependencies
* Describe the schema of new tables and how they relate

ANSWER:
- The Master1 Table contains information about producers, wine and how many bottles where harvest by each producer.
To fit the 2NF, 3NF and BCNF. We should make 3 tables for each.
- The table Producers will contain (NP, NOM, PRENOM, REGION)
- The table Wine will contain (NV, CRU, DEGRE, MILL)
- The table Harvest will contain (ID_HARV, NP, NV, QTE)
As we can see, NP and NV are the primary keys of Producers and Wine, and are related to the table Harvest. Where they are foreign keys

Concerning functional dependencies:
In the table Producers we have: NP->{PRENOM, NOM, REGION}<br/>
In the table Wine we have: NV -> {CRU, MILL, DEGRE}<br/>
In the table Harvest we have: {NV, NP} -> QTE<br/>
A good practice could be to set a primary key for the table harvest.

__1.2__ Convert table Master2 to the Second Normal Form (2NF), Third Normal Form (3NF) and Boyce-Codd Normal Form(BCNF).
* Explain your answer
* List functional dependencies
* Describe the schema of new tables and how they relate

ANSWER:
- The Master2 Table contains information about customer, wine and how many bottles where buyed by each customer.
To fit the 2NF, 3NF and BCNF. We should make 3 tables for each.
- The table Customer will contain (NB, NOM, PRENOM, TYPE, REGION)
- The table Wine will contain (NV, CRU, DEGRE, MILL) (same as the Master1
- The table Buy will contain (ID_BUY, NB, NV, QTE, LIEU, DATES)
As we can see, NB and NV are the primary keys of Customer and Wine, and are related to the table Buy. Where they are foreign keys

Concerning functional dependencies:
In the table Customer we have: NB->{PRENOM, NOM, REGION, TYPE}<br/>
In the table Wine we have: NV -> {CRU, MILL, DEGRE}<br/>
In the table Buy we have: {NB, NV} -> {QTE, LIEU, DATES}<br/>
A good practice could be to set a primary key for the table Buy.

__1.3__ Create the new tables from Master1:

In [7]:
%%sql 

DROP TABLE IF EXISTS Producer;
CREATE TABLE Producer(NP INTEGER PRIMARY KEY, NOM TEXT, PRENOM TEXT,REGION TEXT);
INSERT INTO Producer SELECT DISTINCT NP, NOM, PRENOM, REGION FROM MASTER1 WHERE NP NOT NULL;
SELECT * FROM Producer LIMIT 3;

 * sqlite:///wine.db
Done.
Done.
124 rows affected.
Done.

[(1, 'Bohn', 'Rene', 'Alsace'),
 (2, 'Boxler', 'Albert', 'Alsace'),
 (3, 'Six', 'Paul', 'Alsace')]

In [8]:
%%sql

DROP TABLE IF EXISTS Wine;
CREATE TABLE Wine(NV INTEGER PRIMARY KEY, CRU TEXT, DEGRE FLOAT, MILL INTEGER);
INSERT INTO Wine SELECT DISTINCT NV, CRU, DEGRE, MILL FROM Master1 WHERE NV NOT NULL;
SELECT * FROM Wine LIMIT 3;

 * sqlite:///wine.db
Done.
Done.
102 rows affected.
Done.

[(1, 'Mercurey', 11.5, 1980),
 (2, 'Julienas', 11.3, 1974),
 (3, 'Savigny les Beaunes', 12.1, 1978)]

In [9]:
%%sql

DROP TABLE IF EXISTS Harvest;
CREATE TABLE Harvest(NP INTEGER, NV INTEGER, QTE INTEGER, 
                     FOREIGN KEY(NP) REFERENCES Producer(NP), FOREIGN KEY(NV) REFERENCES Wine(NV));
INSERT INTO Harvest SELECT DISTINCT NP, NV, QTE FROM Master1 WHERE NV AND NP NOT NULL;
SELECT * FROM Harvest LIMIT 3;

 * sqlite:///wine.db
Done.
Done.
140 rows affected.
Done.

[(1, 1, 300), (73, 1, 1), (5, 2, 100)]

__1.4__ Create the new tables from Master2:

In [10]:
%%sql

DROP TABLE IF EXISTS Location;
CREATE TABLE Location(
    LIEU TEXT PRIMARY KEY,
    REGION TEXT
);
INSERT INTO Location SELECT DISTINCT LIEU, REGION FROM Master2 WHERE LIEU NOT NULL;
SELECT * FROM Location LIMIT 3;

 * sqlite:///wine.db
Done.
Done.
18 rows affected.
Done.

[('BORDEAUX', ' NOUVELLE-AQUITAINE'),
 ('PARIS', ' ÎLE-DE-FRANCE'),
 ('RENNES', ' BRETAGNE')]

In [11]:
%%sql
DROP TABLE IF EXISTS Customer;
CREATE TABLE Customer(
    ID_CUSTOMER INTEGER PRIMARY KEY AUTOINCREMENT,
    NB INTEGER,
    NOM TEXT,
    PRENOM TEXT,
    TYPE TEXT,
    REGION TEXT,
    FOREIGN KEY(REGION) REFERENCES Location(REGION)
);
INSERT INTO Customer (NB, NOM, PRENOM, TYPE, REGION) SELECT DISTINCT NB, NOM, PRENOM, TYPE, REGION FROM Master2;
SELECT * FROM Customer LIMIT 3;

 * sqlite:///wine.db
Done.
Done.
109 rows affected.
Done.

[(1, 11, 'Breton', 'Andre', 'petit', None),
 (2, 13, 'Barthes', 'Roland', 'moyen', None),
 (3, 16, 'Balzac', 'Honore de', 'moyen', None)]

In [12]:
%%sql
DROP TABLE IF EXISTS Buy;
CREATE TABLE Buy(
    ID_BUY INTEGER PRIMARY KEY AUTOINCREMENT,
    NB INTEGER,
    NV INTEGER,
    QTE INTEGER,
    LIEU TEXT,
    DATES DATETIME,
    FOREIGN KEY(NB) REFERENCES Customer(NB),
    FOREIGN KEY(LIEU) REFERENCES Location(LIEU),
    FOREIGN KEY(NV) REFERENCES Wine(NV)
);
INSERT INTO Buy (NB, NV, QTE, LIEU, DATES) SELECT DISTINCT NB, NV, QTE, LIEU, DATES FROM Master2;
SELECT * FROM Buy ORDER BY NB LIMIT 3;

 * sqlite:///wine.db
Done.
Done.
185 rows affected.
Done.

[(81, None, 11, None, None, None),
 (83, None, 13, None, None, None),
 (84, None, 14, None, None, None)]

In [13]:
printSchema(conn)

Buy:
  0: ID_BUY(INTEGER) *1
  1: NB(INTEGER)
  2: NV(INTEGER)
  3: QTE(INTEGER)
  4: LIEU(TEXT)
  5: DATES(DATETIME)
Customer:
  0: ID_CUSTOMER(INTEGER) *1
  1: NB(INTEGER)
  2: NOM(TEXT)
  3: PRENOM(TEXT)
  4: TYPE(TEXT)
  5: REGION(TEXT)
Harvest:
  0: NP(INTEGER)
  1: NV(INTEGER)
  2: QTE(INTEGER)
Location:
  0: LIEU(TEXT) *1
  1: REGION(TEXT)
MASTER1:
  0: NV(NUM)
  1: CRU(TEXT)
  2: DEGRE(NUM)
  3: MILL(NUM)
  4: QTE(NUM)
  5: NP(NUM)
  6: NOM(TEXT)
  7: PRENOM(TEXT)
  8: REGION(TEXT)
MASTER2:
  0: NV(NUM)
  1: CRU(TEXT)
  2: DEGRE(NUM)
  3: MILL(NUM)
  4: DATES(DATE)
  5: LIEU(TEXT)
  6: QTE(NUM)
  7: NB(NUM)
  8: NOM(TEXT)
  9: PRENOM(TEXT)
  10: TYPE(TEXT)
  11: REGION(TEXT)
Producer:
  0: NP(INTEGER) *1
  1: NOM(TEXT)
  2: PRENOM(TEXT)
  3: REGION(TEXT)
Wine:
  0: NV(INTEGER) *1
  1: CRU(TEXT)
  2: DEGRE(FLOAT)
  3: MILL(INTEGER)
cles:
  0: NP(NUM)
  1: NV(NUM)
  2: QTE(NUM)
clients:
  0: NB(NUM)
  1: NOM(TEXT)
  2: PRENOM(TEXT)
  3: TYPE(TEXT)
dummy:
  0: DEGRE(NUM)
orders:
  0: NB(NUM)
  1: NV(NUM)
  2: DATES(NUM)
  3: LIEU(TEXT)
  4: QTE(NUM)
producteur:
  0: NP(NUM)
  1: NOM(TEXT)
  2: PRENOM(TEXT)
  3: REGION(TEXT)
producteurs:
  0: NP(NUM)
  1: NOM(TEXT)
  2: PRENOM(TEXT)
  3: REGION(TEXT)
sqlite_sequence:
  0: name()
  1: seq()
vins:
  0: NV(NUM)
  1: CRU(TEXT)
  2: DEGRE(NUM)
  3: MILL(NUM)
vins2:
  0: NV(NUM)
  1: CRU(TEXT)
  2: DEGRE(NUM)
  3: MILL(NUM)
  4: REGION(TEXT)

# PART II: SQL QUERIES

In the second part of this TP you will create SQL queries to retrieve information from the database.

__2.1__ What are the different types of clients (buveurs) by volume of purchases?

In [14]:
%%sql
SELECT DISTINCT TYPE FROM Customer
WHERE TYPE IS NOT NULL;

 * sqlite:///wine.db
Done.

[('petit',), ('moyen',), ('gros',)]

__2.2__ What regions produce Pommard or Brouilly?

In [15]:
%%sql
SELECT p.REGION, w.CRU FROM Producer p
INNER JOIN Harvest h ON p.NP = h.NP
INNER JOIN Wine w ON h.NV = w.NV
WHERE w.cru="Pommard" OR w.cru="Brouilly"

 * sqlite:///wine.db
Done.

[('Bourgogne', 'Pommard'), ('Rhone', 'Pommard'), ('Bourgogne', 'Brouilly')]

__2.3__ What regions produce Pommard and Brouilly?

In [16]:
%%sql
SELECT p.REGION FROM Producer p
INNER JOIN Harvest h ON p.NP = h.NP
INNER JOIN Wine w ON h.NV = w.NV
WHERE w.cru="Pommard" OR w.cru="Brouilly"
GROUP BY p.REGION HAVING COUNT (*) > 1

 * sqlite:///wine.db
Done.

[('Bourgogne',)]

__2.4__ Get the number of wines bught by CRU and Millésime

In [17]:
%%sql
SELECT SUM(b.QTE) AS QTE, w.CRU, w.MILL FROM Buy b
INNER JOIN Wine w ON w.NV = b.NV
GROUP BY w.MILL, w.CRU 
ORDER BY CRU
LIMIT 3;

 * sqlite:///wine.db
Done.

[(None, 'Arbois', 1976), (8, 'Arbois', 1980), (80, 'Auxey Duresses', 1914)]

__2.5__ Retrieve the wine number (NV) of wines produced by more than three producers

In [18]:
%%sql
SELECT w.NV, w.cru, COUNT(p.NP) AS numberf_of_producers FROM Producer p
INNER JOIN Harvest h ON p.NP = h.NP
INNER JOIN Wine w ON h.NV = w.NV
GROUP BY h.NV HAVING COUNT (p.NP) > 3
LIMIT 3;

 * sqlite:///wine.db
Done.

[(45, 'Chiroubles', 5), (78, 'Etoile', 5), (89, 'Cotes de Provence', 4)]

__2.6__ Which producers have not produced any wine?

In [19]:
%%sql
SELECT NP, NBP, NOM FROM (SELECT DISTINCT Producer.NP, Producer.NOM, SUM(Harvest.QTE) AS NBP FROM Producer
                        LEFT JOIN Harvest on Producer.NP = Harvest.NP
                        GROUP BY(Producer.NP))
WHERE NBP IS NULL
LIMIT 3;

 * sqlite:///wine.db
Done.

[(3, None, 'Six'), (6, None, 'Marmagne'), (8, None, "Lioger d'Harduy")]

__2.7__ What clients (buveurs) have bought at least one wine from 1980?

In [20]:
%%sql
SELECT c.ID_CUSTOMER, c.NOM, c.PRENOM, SUM(b.QTE) AS bottles_bought_1980 FROM Customer c
INNER JOIN Buy b on b.NB=c.NB
INNER JOIN Wine w on w.NV=b.NV
WHERE w.MILL=1980
GROUP BY c.NOM, c.PRENOM
LIMIT 3;

 * sqlite:///wine.db
Done.

[(101, 'Aragon', 'Louis', 24),
 (66, 'Artaud', 'Antonin', 66),
 (59, 'Gide', 'Andre', 171)]

__2.8__ What clients (buveurs) have NOT bought any wine from 1980?

In [21]:
%%sql
SELECT c.NOM, c.PRENOM, SUM(b.QTE) AS bottles_bought_1980 FROM Customer c
INNER JOIN Buy b on b.NB=c.NB
INNER JOIN Wine w on w.NV=b.NV
WHERE w.MILL!=1980
GROUP BY NOM, PRENOM
LIMIT 3;

 * sqlite:///wine.db
Done.

[('Ajar', 'Emile', 280), ('Andersen', 'Yann', 1), ('Anouilh', 'Jean', 6)]

__2.9__ What clients (buveurs) have bought ONLY wines from 1980?

In [22]:
%%sql
SELECT c.NOM, c.PRENOM, SUM(b.QTE) AS bottles_bought_1980 FROM Customer c
INNER JOIN Buy b on b.NB=c.NB
INNER JOIN Wine w on w.NV=b.NV
GROUP BY NOM, PRENOM
EXCEPT
SELECT c.NOM, c.PRENOM, SUM(b.QTE) AS bottles_bought_1980 FROM Customer c
INNER JOIN Buy b on b.NB=c.NB
INNER JOIN Wine w on w.NV=b.NV
WHERE w.MILL!=1980
GROUP BY NOM, PRENOM
LIMIT 3;

 * sqlite:///wine.db
Done.

[('Aragon', 'Louis', 264), ('Artaud', 'Antonin', 1166), ('Gide', 'Andre', 171)]

__2.10__ List all wines from 1980

In [23]:
%%sql
SELECT *
FROM Wine
WHERE MILL=1980
ORDER BY NV asc;
LIMIT 3;

 * sqlite:///wine.db
Done.
(sqlite3.OperationalError) near "LIMIT": syntax error [SQL: 'LIMIT 3;'] (Background on this error at: http://sqlalche.me/e/e3q8)

__2.11__ What are the wines from 1980 bought by NB=2?

In [24]:
%%sql
SELECT * FROM Wine w
INNER JOIN Buy b ON w.NV = b.NV
WHERE MILL=1980 AND b.NB=2
GROUP BY w.NV;

 * sqlite:///wine.db
Done.

[(1, 'Mercurey', 11.5, 1980, 58, 2, 1, 33, 'BORDEAUX', '1977-11-02')]

__2.12__ What clients (buveurs) have bought ALL the wines from 1980?

In [25]:
%%sql
SELECT DISTINCT b.NB, COUNT(b.NV) AS Counter, c.PRENOM, c.NOM FROM Buy b
INNER JOIN Wine w ON b.NV=w.NV
INNER JOIN Customer c ON c.NB = b.NB
WHERE w.MILL=1980
GROUP BY b.NB HAVING Counter = 18

 * sqlite:///wine.db
Done.

[(44, 18, 'Andre', 'Gide')]